In [2]:
import pandas as pd

df = pd.read_csv('./Data/exam_sample.csv')
df

   student_no class  science  english  math sex
0           1     A       50       98    50   m
1           2     A       60       97    60   w
2           3     A       78       86    45   w
3           4     A       58       98    30   m
4           5     B       65       80    90   w
5           6     B       98       89    50   m
6           7     B       45       90    80   m
7           8     B       25       78    90   w
8           9     C       15       98    20   w
9          10     C       45       93    50   w

In [3]:
# 반별로 그룹화(A,B,C)
# 반별 그룹 오브젝트만 생성
df1 = df.groupby(['class'])
df1

In [4]:
# 반 중 A반만 그룹 확인
df1.get_group('A')

   student_no class  science  english  math sex
0           1     A       50       98    50   m
1           2     A       60       97    60   w
2           3     A       78       86    45   w
3           4     A       58       98    30   m

In [5]:
# 반별 그룹 평균
df.groupby('class').mean()

       student_no  science  english   math
class
A             2.5    61.50    94.75  46.25
B             6.5    58.25    84.25  77.50
C             9.5    30.00    95.50  35.00

In [6]:
# 반별/성별/그룹/평균확인
df.groupby(['class','sex']).mean()

           student_no  science  english  math
class sex
A     m           2.5     54.0     98.0  40.0
      w           2.5     69.0     91.5  52.5
B     m           6.5     71.5     89.5  65.0
      w           6.5     45.0     79.0  90.0
C     w           9.5     30.0     95.5  35.0

In [9]:
# 반별 수학 평균
df['math'].groupby(df['class']).mean()

class
A    46.25
B    77.50
C    35.00
Name: math, dtype: float64

In [10]:
df.groupby(df['class'])['math'].mean()

class
A    46.25
B    77.50
C    35.00
Name: math, dtype: float64

In [11]:
# 반별 수학 개수
df['math'].groupby(df['class']).count()

class
A    4
B    4
C    2
Name: math, dtype: int64

In [14]:
df_mean = df['math'].groupby(df['sex']).mean()
df_mean

sex
m    52.500000
w    59.166667
Name: math, dtype: float64

In [20]:
# 성별 수학 평균
sexgroup = df.groupby('sex')
print(df_mean)
print(sexgroup)
print(sexgroup.groups)

sex
m    52.500000
w    59.166667
Name: math, dtype: float64
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000012F49B5B8E0>
{'m': [0, 3, 5, 6], 'w': [1, 2, 4, 7, 8, 9]}

In [21]:
# 남학생 수학 평균
male = sexgroup.get_group('m')
subset = male[['sex','math']]
print(male)
print(subset)

   student_no class  science  english  math sex
0           1     A       50       98    50   m
3           4     A       58       98    30   m
5           6     B       98       89    50   m
6           7     B       45       90    80   m
  sex  math
0   m    50
3   m    30
5   m    50
6   m    80